src/test/resources/samples/messages/requests/operation2-req_OK_noheaders.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oper="http://www.example.org/sampleservice/operation2">
    <soapenv:Body>
        <oper:operation2>
            <in>OK</in>
        </oper:operation2>
    </soapenv:Body>
</soapenv:Envelope>